wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    SPIM_SET_SPIM_MODE(spim, CMD_DMA_FAST_READ);    // SPIM mode.
    CU_ASSERT(SPIM_GET_SPIM_MODE(spim) == CMD_DMA_FAST_READ);

    SPIM_SET_4BYTE_ADDR_EN(spim, 0);            // Enable/disable 4-Byte Address.

    spim->SRAMADDR = (uint32_t) pu8RxBuf;       // SRAM u32Address.
    spim->DMACNT = BUFFER_SIZE;                 // Transfer length.
    spim->FADDR = 0;                            // Flash u32Address.
    SPIM_SET_GO(spim);                          // Go.
    CU_ASSERT_TRUE(SPIM_IS_BUSY(spim));

    SPIM_WAIT_FREE(spim);                       // Wait for DMA done.
}

void SPIM_Const_Address()
{
    switch (GetSPIMTestModuleIdx())
    {
        case C_SPIM0:
            CU_ASSERT(SPIM0_DMM_MAP_SADDR == 0x80000000UL);
            CU_ASSERT(SPIM0_DMM_MAP_NSADDR == 0x90000000UL);
            break;

        case C_SPIM1:
            CU_ASSERT(SPIM1_DMM_MAP_SADDR == 0x82000000UL);
            CU_ASSERT(SPIM1_DMM_MAP_NSADDR == 0x92000000UL);
            break;
    }

    CU_ASSERT(SPIM_DMM_SIZE == 0x2000000UL);
    //CU_ASSERT(SPIM_CCM_ADDR == 0x20020000);
    //CU_ASSERT(SPIM_CCM_SIZE == 0x8000);
}

void SPIM_Const_SPIM_CTL0()
{
    CU_ASSERT(SPIM_CTL0_RW_IN(0) == SPIM_CTL0_QDIODIR_Msk);

    CU_ASSERT(SPIM_CTL0_BITMODE_SING == (0UL << SPIM_CTL0_BITMODE_Pos));
    CU_ASSERT(SPIM_CTL0_BITMODE_DUAL == (1UL << SPIM_CTL0_BITMODE_Pos));
    CU_ASSERT(SPIM_CTL0_BITMODE_QUAD == (2UL << SPIM_CTL0_BITMODE_Pos));
    CU_ASSERT(SPIM_CTL0_BITMODE_OCTAL == (3UL << SPIM_CTL0_BITMODE_Pos));

    CU_ASSERT(SPIM_CTL0_OPMODE_IO == (0UL << SPIM_CTL0_OPMODE_Pos));
    CU_ASSERT(SPIM_CTL0_OPMODE_PAGEWRITE == (1UL << SPIM_CTL0_OPMODE_Pos));
    CU_ASSERT(SPIM_CTL0_OPMODE_PAGEREAD == (2UL << SPIM_CTL0_OPMODE_Pos));
    CU_ASSERT(SPIM_CTL0_OPMODE_DIRECTMAP == (3UL << SPIM_CTL0_OPMODE_Pos));

    //Read Byte Order Mode
    CU_ASSERT(SPIM_CTL0_RBO_MODE0 == (0UL << SPIM_CTL0_RBO_NORM_Pos));
    CU_ASSERT(SPIM_CTL0_RBO_MODE1 == (1UL << SPIM_CTL0_RBO_NORM_Pos));
    CU_ASSERT(SPIM_CTL0_RBO_MODE2 == (2UL << SPIM_CTL0_RBO_NORM_Pos));
    CU_ASSERT(SPIM_CTL0_RBO_MODE3 == (3UL << SPIM_CTL0_RBO_NORM_Pos));
}

void SPIM_Const_SPIM_CMDCODE()
{
    //--------------------------------------------------------------------------
    // SPI Flash Write Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_NORMAL_PAGE_PROGRAM == (0x02));
    CU_ASSERT(CMD_NORMAL_PAGE_PROGRAM_4B == (0x12));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_WINBOND == (0x32));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_WINBOND_4B == (0x34));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_MXIC == (0x38));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_EON == (0x40));

    CU_ASSERT(CMD_OCTAL_PAGE_PROG_MICRON == (0x82UL));
    CU_ASSERT(CMD_OCTAL_PAGE_PROG_MICRON_4B == (0x84UL));
    CU_ASSERT(CMD_OCTAL_EX_PAGE_PROG_MICRON == (0xC2UL));
    CU_ASSERT(CMD_OCTAL_EX_PAGE_PROG_MICRON_4B == (0x8EUL));

    //--------------------------------------------------------------------------
    // SPI Flash Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_DMA_NORMAL_READ == (0x03UL));
    CU_ASSERT(CMD_DMA_NORMAL_READ_4B == (0x13UL));
    CU_ASSERT(CMD_DMA_FAST_READ == (0x0BUL));
    CU_ASSERT(CMD_DMA_FAST_READ_4B == (0x0CUL));
    CU_ASSERT(CMD_DMA_NORMAL_DTR_READ == (0x0DUL));

    //--------------------------------------------------------------------------
    // Dual Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_DMA_NORMAL_DUAL_READ == (0x3BUL));
    CU_ASSERT(CMD_DMA_NORMAL_DUAL_READ_4B == (0x3CUL));
    CU_ASSERT(CMD_DMA_FAST_DUAL_READ == (0xBBUL));
    CU_ASSERT(CMD_DMA_FAST_DUAL_READ_4B == (0xBCUL));
    CU_ASSERT(CMD_DMA_FAST_DUAL_DTR_READ == (0xBDUL));

    //--------------------------------------------------------------------------
    // Quad Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_DMA_FAST_READ_QUAD_OUTPUT == (0x6BUL));
    CU_ASSERT(CMD_DMA_FAST_READ_QUAD_OUTPUT_4B == (0x6CUL));
    CU_ASSERT(CMD_DMA_FAST_QUAD_READ == (0xEBUL));
    CU_ASSERT(CMD_DMA_FAST_QUAD_READ_4B == (0xECUL));
    CU_ASSERT(CMD_DMA_FAST_QUAD_DTR_READ == (0xEDUL));

    //--------------------------------------------------------------------------
    // Micron Octal Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_OCTAL_FAST_READ_OUTPUT == (0x8BUL));
    CU_ASSERT(CMD_OCTAL_FAST_IO_READ == (0xCBUL));
    CU_ASSERT(CMD_OCTAL_FAST_READ_OUTPUT_4B == (0x7CUL));
    CU_ASSERT(CMD_OCTAL_FAST_IO_READ_4B == (0xCCUL));
    CU_ASSERT(CMD_OCTAL_DDR_FAST_READ_OUTPUT == (0x9DUL));
    CU_ASSERT(CMD_OCTAL_DDR_FAST_IO_READ == (0xFDUL));
}

void SPIM_Const_SPIM_PHASE()
{
    //--------------------------------------------------------------------------
    // Continue Read Mode Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_CLEAR_MODE_DATA == (0x00));
    CU_ASSERT(CMD_CONTINUE_READ_MODE == (0x20));

    CU_ASSERT(CMD_WRAP_8BIT == (0x00));
    CU_ASSERT(CMD_WRAP_16BIT == (0x20));
    CU_ASSERT(CMD_WRAP_32BIT == (0x40));
    CU_ASSERT(CMD_WRAP_64BIT == (0x60));

    /*------------------------------------------------------------------------*/
    /* SPIM_PHDMAW, SPIM_PHDMAR, SPIM_PHDMM constant definitions              */
    /*------------------------------------------------------------------------*/
    CU_ASSERT(PHASE_NORMAL_MODE == (0x0));
    CU_ASSERT(PHASE_DUAL_MODE == (0x1));
    CU_ASSERT(PHASE_QUAD_MODE == (0x2));
    CU_ASSERT(PHASE_OCTAL_MODE == (0x3));

    CU_ASSERT(PHASE_ORDER_MODE0 == (0x0));
    CU_ASSERT(PHASE_ORDER_MODE1 == (0x1));
    CU_ASSERT(PHASE_ORDER_MODE2 == (0x2));
    CU_ASSERT(PHASE_ORDER_MODE3 == (0x3));

    CU_ASSERT(PHASE_WIDTH_8 == (0x1));
    CU_ASSERT(PHASE_WIDTH_16 == (0x2));
    CU_ASSERT(PHASE_WIDTH_24 == (0x3));
    CU_ASSERT(PHASE_WIDTH_32 == (0x4));
}

