wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    CU_PASS();
}

void MACRO_SPIM_CTL2()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
#if 0
    /*
     *  _SPIM_SET_DCNUM(x)
     */
    SPIM->CTL2 = 0;
    _SPIM_SET_DCNUM(0x13);
    CU_ASSERT(((SPIM->CTL2 & SPIM_CTL2_DCNUM_Msk) >> SPIM_CTL2_DCNUM_Pos) == 0x13);
    CU_ASSERT_TRUE(SPIM->CTL2 & SPIM_CTL2_USETEN_Msk);
    SPIM->CTL2 = 0;
    _SPIM_SET_DCNUM(0xc);
    CU_ASSERT(((SPIM->CTL2 & SPIM_CTL2_DCNUM_Msk) >> SPIM_CTL2_DCNUM_Pos) == 0xc);
    CU_ASSERT_TRUE(SPIM->CTL2 & SPIM_CTL2_USETEN_Msk);

    /*
     *  _SPIM_SET_DEFAULT_DCNUM()
     */
    SPIM->CTL2 |= SPIM_CTL2_USETEN_Msk;
    _SPIM_SET_DEFAULT_DCNUM();
    CU_ASSERT_FALSE(SPIM->CTL2 & SPIM_CTL2_USETEN_Msk);
#endif //0
    /*
     *  SPIM_SET_DC_DMAR(x)
     */
    pSPIMModule->CTL2 = 0;
    SPIM_SET_DC_DMAR(pSPIMModule, 0x13);
    CU_ASSERT(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMAR_Msk) >> SPIM_CTL2_DC_DMAR_Pos) == 0x13);
    SPIM_CLEAR_DC_DMAR(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMAR_Msk) >> SPIM_CTL2_DC_DMAR_Pos));

    pSPIMModule->CTL2 = 0;
    SPIM_SET_DC_DMAR(pSPIMModule, 0x0c);
    CU_ASSERT(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMAR_Msk) >> SPIM_CTL2_DC_DMAR_Pos) == 0x0c);
    SPIM_CLEAR_DC_DMAR(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMAR_Msk) >> SPIM_CTL2_DC_DMAR_Pos));

    /*
     *  SPIM_SET_DC_DMAR(x)
     */
    pSPIMModule->CTL2 = 0;
    SPIM_SET_DC_DMM(pSPIMModule, 0x13);
    CU_ASSERT(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMM_Msk) >> SPIM_CTL2_DC_DMM_Pos) == 0x13);
    SPIM_CLEAR_DC_DMM(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMM_Msk) >> SPIM_CTL2_DC_DMM_Pos));

    pSPIMModule->CTL2 = 0;
    SPIM_SET_DC_DMM(pSPIMModule, 0x0c);
    CU_ASSERT(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMM_Msk) >> SPIM_CTL2_DC_DMM_Pos) == 0x0c);
    SPIM_CLEAR_DC_DMM(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->CTL2 & SPIM_CTL2_DC_DMM_Msk) >> SPIM_CTL2_DC_DMM_Pos));

    CU_PASS();
}

void MACRO_SPIM_DMA_WRITE_PHASE()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
    /*
     *  SPIM_PHDMAW_CMD_WIDTH(x)
     */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_CMD_Msk) >> SPIM_PHDMAW_DW_CMD_Pos) == 0x1);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_CMD_Msk) >> SPIM_PHDMAW_DW_CMD_Pos) == 0x2);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_CMD_Msk) >> SPIM_PHDMAW_DW_CMD_Pos) == 0x3);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_CMD_Msk) >> SPIM_PHDMAW_DW_CMD_Pos) == 0x4);

    /*
     *  SPIM_PHDMAW_CMD_DTR_ENABLE(x)
     */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DTR_CMD_Msk) >> SPIM_PHDMAW_DTR_CMD_Pos));
    SPIM_PHDMAW_CMD_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DTR_CMD_Msk) >> SPIM_PHDMAW_DTR_CMD_Pos));

    /*
     *  SPIM_PHDMAW_CMD_BIT_MODE(x)
     */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_BIT_MODE(pSPIMModule, 0);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_CMD_Msk) >> SPIM_PHDMAW_BM_CMD_Pos) == 0x0);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_CMD_Msk) >> SPIM_PHDMAW_BM_CMD_Pos) == 0x1);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_CMD_Msk) >> SPIM_PHDMAW_BM_CMD_Pos) == 0x2);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_CMD_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_CMD_Msk) >> SPIM_PHDMAW_BM_CMD_Pos) == 0x3);

    /*
      *  SPIM_PHDMAW_ADDR_WIDTH(x)
      */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_ADDR_Msk) >> SPIM_PHDMAW_DW_ADDR_Pos) == 0x1);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_ADDR_Msk) >> SPIM_PHDMAW_DW_ADDR_Pos) == 0x2);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_ADDR_Msk) >> SPIM_PHDMAW_DW_ADDR_Pos) == 0x3);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DW_ADDR_Msk) >> SPIM_PHDMAW_DW_ADDR_Pos) == 0x4);

    /*
     *  SPIM_PHDMAW_ADDR_DTR_ENABLE(x)/ SPIM_PHDMAW_ADDR_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DTR_ADDR_Msk) >> SPIM_PHDMAW_DTR_ADDR_Pos));
    SPIM_PHDMAW_ADDR_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DTR_ADDR_Msk) >> SPIM_PHDMAW_DTR_ADDR_Pos));

    /*
      *  SPIM_PHDMAW_ADDR_BIT_MODE(x)
      */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_BIT_MODE(pSPIMModule, 0x0);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_ADDR_Msk) >> SPIM_PHDMAW_BM_ADDR_Pos) == 0x0);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_ADDR_Msk) >> SPIM_PHDMAW_BM_ADDR_Pos) == 0x1);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_ADDR_Msk) >> SPIM_PHDMAW_BM_ADDR_Pos) == 0x2);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_ADDR_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_ADDR_Msk) >> SPIM_PHDMAW_BM_ADDR_Pos) == 0x3);

    /*
     *  SPIM_PHDMAW_DATA_DTR_ENABLE(x)/ SPIM_PHDMAW_DATA_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_DATA_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DTR_DATA_Msk) >> SPIM_PHDMAW_DTR_DATA_Pos));
    SPIM_PHDMAW_DATA_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAW & SPIM_PHDMAW_DTR_DATA_Msk) >> SPIM_PHDMAW_DTR_DATA_Pos));

