wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    /*
      *  SPIM_PHDMAW_PBO_DATA(x)
      */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_PBO_DATA(pSPIMModule, 0x0);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_PBO_DATA_Msk) >> SPIM_PHDMAW_PBO_DATA_Pos) == 0x0);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_PBO_DATA(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_PBO_DATA_Msk) >> SPIM_PHDMAW_PBO_DATA_Pos) == 0x1);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_PBO_DATA(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_PBO_DATA_Msk) >> SPIM_PHDMAW_PBO_DATA_Pos) == 0x2);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_PBO_DATA(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_PBO_DATA_Msk) >> SPIM_PHDMAW_PBO_DATA_Pos) == 0x3);

    /*
      *  SPIM_PHDMAW_DATA_BIT_MODE(x)
      */
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_DATA_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_DATA_Msk) >> SPIM_PHDMAW_BM_DATA_Pos) == 0x1);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_DATA_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_DATA_Msk) >> SPIM_PHDMAW_BM_DATA_Pos) == 0x2);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_DATA_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_DATA_Msk) >> SPIM_PHDMAW_BM_DATA_Pos) == 0x3);
    pSPIMModule->PHDMAW = 0;
    SPIM_PHDMAW_DATA_BIT_MODE(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAW & SPIM_PHDMAW_BM_DATA_Msk) >> SPIM_PHDMAW_BM_DATA_Pos) == 0x4);

    SPIM_CLEAR_PHDMAW(pSPIMModule);
    CU_ASSERT(pSPIMModule->PHDMAW == 0x0);

    CU_PASS();
}

void MACRO_SPIM_DMA_READ_PHASE()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
    /*
     *  SPIM_PHDMAR_CMD_WIDTH(x)
     */
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_CMD_Msk) >> SPIM_PHDMAR_DW_CMD_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_CMD_Msk) >> SPIM_PHDMAR_DW_CMD_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_CMD_Msk) >> SPIM_PHDMAR_DW_CMD_Pos) == 0x3);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_CMD_Msk) >> SPIM_PHDMAR_DW_CMD_Pos) == 0x4);

    /*
     *  SPIM_PHDMAR_CMD_DTR_ENABLE(x) / SPIM_PHDMAR_CMD_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_CMD_Msk) >> SPIM_PHDMAR_DTR_CMD_Pos));
    SPIM_PHDMAR_CMD_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_CMD_Msk) >> SPIM_PHDMAR_DTR_CMD_Pos));

    /*
     *  SPIM_PHDMAR_CMD_BIT_MODE(x)
     */
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_BIT_MODE(pSPIMModule, 0);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_CMD_Msk) >> SPIM_PHDMAR_BM_CMD_Pos) == 0x0);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_CMD_Msk) >> SPIM_PHDMAR_BM_CMD_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_CMD_Msk) >> SPIM_PHDMAR_BM_CMD_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_CMD_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_CMD_Msk) >> SPIM_PHDMAR_BM_CMD_Pos) == 0x3);

    /*
      *  SPIM_PHDMAR_ADDR_WIDTH(x)
      */
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_ADDR_Msk) >> SPIM_PHDMAR_DW_ADDR_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_ADDR_Msk) >> SPIM_PHDMAR_DW_ADDR_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_ADDR_Msk) >> SPIM_PHDMAR_DW_ADDR_Pos) == 0x3);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_ADDR_Msk) >> SPIM_PHDMAR_DW_ADDR_Pos) == 0x4);

    /*
     *  SPIM_PHDMAR_ADDR_DTR_ENABLE(x)/ SPIM_PHDMAR_ADDR_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_ADDR_Msk) >> SPIM_PHDMAR_DTR_ADDR_Pos));
    SPIM_PHDMAR_ADDR_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_ADDR_Msk) >> SPIM_PHDMAR_DTR_ADDR_Pos));

    /*
      *  SPIM_PHDMAR_ADDR_BIT_MODE(x)
      */
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_BIT_MODE(pSPIMModule, 0x0);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_ADDR_Msk) >> SPIM_PHDMAR_BM_ADDR_Pos) == 0x0);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_ADDR_Msk) >> SPIM_PHDMAR_BM_ADDR_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_ADDR_Msk) >> SPIM_PHDMAR_BM_ADDR_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_ADDR_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_ADDR_Msk) >> SPIM_PHDMAR_BM_ADDR_Pos) == 0x3);

    /*
      *  SPIM_PHDMAR_READ_DATA_WIDTH(x)
      */
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x3);
    pSPIMModule->PHDMAR = 0;
    SPIM_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x4);

