wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    /*
     *  SPIM_SET_DLL0_DELAY_NUM(x)
     */
    pSPIMModule->DLL0 = 0;
    SPIM_SET_DLL0_DELAY_NUM(pSPIMModule, 1);
    CU_ASSERT(((pSPIMModule->DLL0 & SPIM_DLL1_DLLOVNUM_Msk) >> SPIM_DLL0_DLL_DNUM_Pos) == 1);
    pSPIMModule->DLL0 = 0;
    SPIM_SET_DLL0_DELAY_NUM(pSPIMModule, 7);
    CU_ASSERT(((pSPIMModule->DLL0 & SPIM_DLL0_DLL_DNUM_Msk) >> SPIM_DLL0_DLL_DNUM_Pos) == 7);
    pSPIMModule->DLL0 = 0;
    SPIM_SET_DLL0_DELAY_NUM(pSPIMModule, 15);
    CU_ASSERT(((pSPIMModule->DLL0 & SPIM_DLL0_DLL_DNUM_Msk) >> SPIM_DLL0_DLL_DNUM_Pos) == 15);

    CU_PASS();
}

void MACRO_SPIM_DLL1()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
    /*
    *  SPIM_SET_DLL1_OUT_VALID(x)
    */
    pSPIMModule->DLL1 = 0;
    SPIM_SET_DLL1_OUT_VALID(pSPIMModule, 0x55AA);
    CU_ASSERT(((pSPIMModule->DLL1 & SPIM_DLL1_DLLOVNUM_Msk) >> SPIM_DLL1_DLLOVNUM_Pos) == 0x55AA);
    pSPIMModule->DLL1 = 0;
    SPIM_SET_DLL1_OUT_VALID(pSPIMModule, 0xAA55);
    CU_ASSERT(((pSPIMModule->DLL1 & SPIM_DLL1_DLLOVNUM_Msk) >> SPIM_DLL1_DLLOVNUM_Pos) == 0xAA55);

    /*
    *  SPIM_SET_DLL1_LOCKK_VALID(x)
    */
    pSPIMModule->DLL1 = 0;
    SPIM_SET_DLL1_LOCKK_VALID(pSPIMModule, 0x55AA);
    CU_ASSERT(SPIM_GET_DLL1_LOCKK_VALID(pSPIMModule) == 0x55AA);
    pSPIMModule->DLL1 = 0;
    SPIM_SET_DLL1_LOCKK_VALID(pSPIMModule, 0xAA55);
    CU_ASSERT(SPIM_GET_DLL1_LOCKK_VALID(pSPIMModule) == 0xAA55);

    /*
    *  SPIM_SET_DLL1_LOCK_TIME(x)
    */
    pSPIMModule->DLL1 = 0;
    SPIM_SET_DLL1_LOCK_TIME(pSPIMModule, 0x55AA);
    CU_ASSERT(((pSPIMModule->DLL1 & SPIM_DLL1_DLLLKNUM_Msk) >> SPIM_DLL1_DLLLKNUM_Pos) == 0x55AA);
    pSPIMModule->DLL1 = 0;
    SPIM_SET_DLL1_LOCK_TIME(pSPIMModule, 0xAA55);
    CU_ASSERT(((pSPIMModule->DLL1 & SPIM_DLL1_DLLLKNUM_Msk) >> SPIM_DLL1_DLLLKNUM_Pos) == 0xAA55);

    CU_PASS();
}

void MACRO_SPIM_DLL2()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
    /*
    *  SPIM_SET_DLL2_CLKON_NUM(x)
    */
    pSPIMModule->DLL2 = 0;
    SPIM_SET_DLL2_CLKON_NUM(pSPIMModule, 0x55AA);
    CU_ASSERT(((pSPIMModule->DLL2 & SPIM_DLL2_CLKONNUM_Msk) >> SPIM_DLL2_CLKONNUM_Pos) == 0x55AA);
    pSPIMModule->DLL2 = 0;
    SPIM_SET_DLL2_CLKON_NUM(pSPIMModule, 0xAA55);
    CU_ASSERT(((pSPIMModule->DLL2 & SPIM_DLL2_CLKONNUM_Msk) >> SPIM_DLL2_CLKONNUM_Pos) == 0xAA55);

    /*
    *  SPIM_SET_DLL2_TRIM_NUM(x)
    */
    pSPIMModule->DLL2 = 0;
    SPIM_SET_DLL2_TRIM_NUM(pSPIMModule, 0x55AA);
    CU_ASSERT(((pSPIMModule->DLL2 & SPIM_DLL2_TRIMNUM_Msk) >> SPIM_DLL2_TRIMNUM_Pos) == 0x55AA);
    pSPIMModule->DLL2 = 0;
    SPIM_SET_DLL2_TRIM_NUM(pSPIMModule, 0xAA55);
    CU_ASSERT(((pSPIMModule->DLL2 & SPIM_DLL2_TRIMNUM_Msk) >> SPIM_DLL2_TRIMNUM_Pos) == 0xAA55);

    CU_PASS();
}

void MACRO_SPIM_GetSClkFreq()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 0);

    CU_ASSERT(SPIM_GetSClkFreq(pSPIMModule) == SystemCoreClock);

    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 1);

    CU_ASSERT(SPIM_GetSClkFreq(pSPIMModule) == SystemCoreClock / 2);

    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 2);

    CU_ASSERT(SPIM_GetSClkFreq(pSPIMModule) == SystemCoreClock / 4);

    CU_PASS();
}

int dma_read_write(SPIM_T *spim, int is4ByteAddr, uint32_t u32RdCmd, uint32_t WrCmd, int dc_num)
{
    uint32_t i, offset;             /* variables */
    uint32_t *pData;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();
    uint8_t *u8TstBuf2 = (uint8_t *)GetTestBuffer2();

    SPIM_Enable_4Bytes_Mode(spim, is4ByteAddr, 1, 0);

    if (is4ByteAddr)
    {
        CU_ASSERT(SPIM_Is4ByteModeEnable(spim, 1) == 1);
    }
    else
    {
        CU_ASSERT(SPIM_Is4ByteModeEnable(spim, 1) == 0);
    }

    /*
     *  Erase flash page
     */
    //SPIM_EraseBlock(spim, 0, is4ByteAddr, OPCODE_BE_64K, 1, 1);
    SPIM_EraseAddrRange(spim, 0, is4ByteAddr, FLASH_PAGE_SIZE, OPCODE_BE_64K, FLASH_PAGE_SIZE, 1);

    /*
     *  Verify flash page be erased
     */
    SPIM_DMADMM_SetCMDPhase(spim,
                            SPIM_CTL0_OPMODE_PAGEREAD,
                            PHASE_NORMAL_MODE,
                            PHASE_WIDTH_8,
                            0);
    SPIM_DMADMM_SetAddrPhase(spim,
                             SPIM_CTL0_OPMODE_PAGEREAD,
                             PHASE_NORMAL_MODE,
                             PHASE_WIDTH_24,
                             0);
    SPIM_DMADMM_SetDataPhase(spim,
                             SPIM_CTL0_OPMODE_PAGEREAD,
                             PHASE_NORMAL_MODE,
                             PHASE_ORDER_MODE0,
                             0,
                             0);
    //printf("pSPIMx->PHDMAR = 0x%08X\r\n", spim->PHDMAR);
    CU_ASSERT(spim->PHDMAR == 0x00000301);
    // Set Dummy Cycle After Address.
    SPIM_SET_DC_DMAR(spim, 0);

    for (offset = 0; offset < FLASH_PAGE_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf1, 0, BUFFER_SIZE);

        SPIM_DMA_Read(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf1, u32RdCmd, 1);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("FAILED!\n");
                printf("Erase DMA R/W - Flash address 0x%x, read 0x%x!\n", i, *pData);
                return -1;
            }
        }
    }

    /*
     *  Program data to flash block
     */
    SPIM_FindAndInitDMADMMPhase(spim,
                                gWinbondCMDTable,
                                sizeof(gWinbondCMDTable) / sizeof(PHASE_SET_T),
                                SPIM_CTL0_OPMODE_PAGEWRITE,
                                CMD_NORMAL_PAGE_PROGRAM);
    //printf("pSPIMx->PHDMAW = 0x%08X\r\n", spim->PHDMAW);
    CU_ASSERT(spim->PHDMAW == 0x00000301);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);

        SPIM_DMA_Write(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf1, WrCmd);
    }

