wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    /*
     *  Verify flash block data
     */
    SPIM_FindAndInitDMADMMPhase(spim,
                                gWinbondCMDTable,
                                sizeof(gWinbondCMDTable) / sizeof(PHASE_SET_T),
                                SPIM_CTL0_OPMODE_PAGEREAD,
                                CMD_DMA_NORMAL_READ);
    //printf("pSPIMx->PHDMAR = 0x%08X\r\n", spim->PHDMAR);
    CU_ASSERT(spim->PHDMAR == 0x00000301);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);

        memset(u8TstBuf2, 0, BUFFER_SIZE);
        SPIM_DMA_Read(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf2, u32RdCmd, 1);

        // Compare.
        if (memcmp(u8TstBuf1, u8TstBuf2, BUFFER_SIZE))
        {
            printf("FAILED!\n");
            dump_compare_error(offset, u8TstBuf1, u8TstBuf2, BUFFER_SIZE);
            CU_FAIL();
            return -1;
        }
    }

    printf("done.\n");
    return 0;
}

void SPIM_Basic_Func()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_ReadJedecId(pSPIMModule, idBuf, sizeof(idBuf), 1, 0, 0);
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    if ((idBuf[0] != MFGID_WINBOND) &&
            (idBuf[0] != MFGID_MXIC) &&
            (idBuf[0] != MFGID_EON) &&
            (idBuf[0] != MFGID_ISSI) &&
            (idBuf[0] != MFGID_SPANSION) &&
            (idBuf[0] != MFGID_MICRON))
    {
        CU_FAIL();
    }
    else
    {
        CU_PASS();
    }
}

void SPIM_DMA_Func()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    if (dma_read_write(pSPIMModule, 0, CMD_DMA_NORMAL_READ, CMD_NORMAL_PAGE_PROGRAM, 8) < 0)
    {
        printf("dma_read_write FAILED!!\n");
        CU_FAIL();
    }

    CU_PASS();
}

void SPIM_Chip_Erase_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);       /* Set SPIM clock as HCLK divided by 2 */

    //SPIM_SET_DCNUM(pSPIMModule, 8);                /* 8 is the default value. */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    if (dma_read_write(pSPIMModule, 0, CMD_DMA_FAST_READ, CMD_NORMAL_PAGE_PROGRAM, 8) < 0)
    {
        printf("dma_read_write FAILED!!\n");
        CU_FAIL();
    }

    printf("Doing Chip Erase...\n");
    SPIM_ChipErase(pSPIMModule, 1, 1);
    printf("Chip Erase done.\n");

    /*
     *  Verify flash page be erased
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf1, 0, BUFFER_SIZE);
        SPIM_DMA_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf1, CMD_DMA_FAST_READ, 1);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("FAILED!\n");
                printf("Chip Erase - Flash address 0x%x, read 0x%x!\n", i, *pData);
                CU_FAIL();
            }
        }
    }

    printf("DMA Test done.\n");
    CU_PASS();
}

void SPIM_IO_WriteFunc()
{
    uint32_t offset = 0;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    /*
     *  Program data to flash block
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);

        SPIM_IO_Write(pSPIMModule,
                      offset,
                      0,
                      BUFFER_SIZE,
                      u8TstBuf1,
                      CMD_QUAD_PAGE_PROGRAM_WINBOND,
                      1,
                      1,
                      4,
                      0);
        //SPIM_IO_Write(pSPIMModule, offset, 0, BUFFER_SIZE, g_buff, OPCODE_PP, 1, 1, 1);
    }

    SPIM_SetQuadEnable(pSPIMModule, 0, 1);
}

void SPIM_IO_RW_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();
    uint8_t *u8TstBuf2 = (uint8_t *)GetTestBuffer2();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    //SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);       /* Set SPIM clock as HCLK divided by 4 */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_Enable_4Bytes_Mode(pSPIMModule, 0, 1, 0);

    CU_ASSERT(SPIM_Is4ByteModeEnable(pSPIMModule, 1) == 0);

    /*
     *  Erase flash page
     */
    //SPIM_EraseBlock(pSPIMModule, 0, 0, OPCODE_BE_64K, 1, 1);
    SPIM_EraseAddrRange(pSPIMModule, 0, 0, FLASH_PAGE_SIZE, OPCODE_BE_64K, FLASH_PAGE_SIZE, 1);

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    /*
     *  Verify flash page be erased
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf1, 0, BUFFER_SIZE);
        //SPIM_IO_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf1, 0xeb, 1, 4, 4, 3, 0);
        SPIM_IO_SendCMDPhase(pSPIMModule, 0xEB, PHASE_NORMAL_MODE, 0, 0);
        SPIM_IO_SendAddrPhase(pSPIMModule, 0, offset, PHASE_QUAD_MODE, 0, 0);
        //SPIM_IO_DCPhase(pSPIMModule, 2, PHASE_QUAD_MODE, 0);
        SPIM_IO_SendDummyCycle(pSPIMModule, 4);
        SPIM_IO_SendDataPhase(pSPIMModule, u8TstBuf1, BUFFER_SIZE, PHASE_QUAD_MODE, 0, 0);
        //SPIM_Phase_IORead(pSPIMModule, &gWb_EDh_Command, offset, 0, u8TstBuf1, BUFFER_SIZE);

